IDEA StatiCa Open Model
SetupValueShort Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Setup value bool
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.SetupValue
 IdeaRS.OpenModel.Concrete.SetupValueShort
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class SetupValueShort : SetupValue
Public Class SetupValueShort
	Inherits SetupValue
public ref class SetupValueShort : public SetupValue
The SetupValueShort type exposes the following members.
Constructors
Name | Description
SetupValueShort
Initializes a new instance of the SetupValueShort class
Top
Properties
Name | Description
Id
 Gets or sets the value id.
 (Inherited from SetupValue.)
Value
 Gets or sets the value.
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace